CYFS3/IOT/docs/合泰/资料/HT32F52352开发板资料v1.1/2、开发板源代码/26、IAP实验/app-触摸屏实验/HARDWARE/touch.c
#include "ht32.h"
#include "touch.h" 
#include "lcd.h"
#include "delay.h"
#include "stdlib.h"
#include "math.h"
#include "24cxx.h"	    
#include "spi.h"

u8 TouchSta=0;
u8 TouchType=0;

u16 TouchX=0;
u16 TouchY=0;

u16 TouchXBak=0;
u16 TouchYBak=0;


float TouchFacX=0;//保存x校正因素  
float TouchFacY=0;//保存y校正因素 
short TouchXoff=0;//保存x偏移量
short TouchYoff=0;//保存y偏移量

#define TDIN GPIO_ReadInBit(HT_GPIOA,GPIO_PIN_6)
#define PEN  GPIO_ReadInBit(HT_GPIOB,GPIO_PIN_8)


void DOUT(u8 a)
{
	if(a) GPIO_SetOutBits(HT_GPIOA,GPIO_PIN_5);
	else GPIO_ClearOutBits(HT_GPIOA,GPIO_PIN_5);
}

void TCLK(u8 a)
{
	if(a) GPIO_SetOutBits(HT_GPIOA,GPIO_PIN_4);
	else GPIO_ClearOutBits(HT_GPIOA,GPIO_PIN_4);
}

void TCS(u8 a)
{
	if(a) GPIO_SetOutBits(HT_GPIOA,GPIO_PIN_7);
	else GPIO_ClearOutBits(HT_GPIOA,GPIO_PIN_7);
}


//默认为touchtype=0的数据.
u8 CMD_RDX=0XD0;
u8 CMD_RDY=0X90;
 	 			    					   
//SPI写数据
//向触摸屏IC写入1byte数据    
//num:要写入的数据
void TP_Write_Byte(u8 num)    
{  
	u8 count=0;   
	for(count=0;count<8;count++)  
	{ 	  
		if(num&0x80)DOUT(1);  
		else DOUT(0);   
		num<<=1;    
		TCLK(0); 	 
		TCLK(1);		//上升沿有效	        
	}		 			    
} 		 
//SPI读数据 
//从触摸屏IC读取adc值
//CMD:指令
//返回值:读到的数据	   
u16 TP_Read_AD(u8 CMD)	  
{ 	 
	u8 count=0; 	  
	u16 Num=0; 
	TCLK(0);		//先拉低时钟 	 
	DOUT(0); 	//拉低数据线
	TCS(0); 		//选中触摸屏IC
	TP_Write_Byte(CMD);//发送命令字
	delay_us(6);//ADS7846的转换时间最长为6us
	TCLK(0); 	     	    
	delay_us(1);    	   
	TCLK(1);		//给1个时钟，清除BUSY	    	    
	TCLK(0); 	     	    
	for(count=0;count<16;count++)//读出16位数据,只有高12位有效 
	{ 				  
		Num<<=1; 	 
		TCLK(0);	//下降沿有效  	    	   
		TCLK(1);
		if(TDIN)Num++; 		 
	}  	
	Num>>=4;   	//只有高12位有效.
	TCS(1);		//释放片选	 
	return(Num);   
}
//读取一个坐标值(x或者y)
//连续读取READ_TIMES次数据,对这些数据升序排列,
//然后去掉最低和最高LOST_VAL个数,取平均值 
//xy:指令（CMD_RDX/CMD_RDY）
//返回值:读到的数据
#define READ_TIMES 5 	//读取次数
#define LOST_VAL 1	  	//丢弃值

u16 TP_Read_XOY(u8 xy)
{
	u16 i, j;
	u16 buf[READ_TIMES];
	u16 sum=0;
	u16 temp;
	for(i=0;i<READ_TIMES;i++)buf[i]=TP_Read_AD(xy);		 		    
	for(i=0;i<READ_TIMES-1; i++)//排序
	{
		for(j=i+1;j<READ_TIMES;j++)
		{
			if(buf[i]>buf[j])//升序排列
			{
				temp=buf[i];
				buf[i]=buf[j];
				buf[j]=temp;
			}
		}
	}	  
	sum=0;
	for(i=LOST_VAL;i<READ_TIMES-LOST_VAL;i++)sum+=buf[i];
	temp=sum/(READ_TIMES-2*LOST_VAL);
	return temp;   
} 
//读取x,y坐标
//x,y:读取到的坐标值
//返回值:0,失败;1,成功。
u8 TP_Read_XY(u16 *x,u16 *y)
{
	u16 xtemp,ytemp;			 	 		  
	xtemp=TP_Read_XOY(CMD_RDX);
	ytemp=TP_Read_XOY(CMD_RDY);	 
	*x=xtemp;
	*y=ytemp;
	return 1;//读数成功
}
//连续2次读取触摸屏IC,且这两次的偏差不能超过
//ERR_RANGE,满足条件,则认为读数正确,否则读数错误.	   
//该函数能大大提高准确度
//x,y:读取到的坐标值
//返回值:0,失败;1,成功。
#define ERR_RANGE 50 //误差范围 
u8 TP_Read_XY2(u16 *x,u16 *y) 
{
	u16 x1,y1;
 	u16 x2,y2;
 	u8 flag;    
    flag=TP_Read_XY(&x1,&y1);   
    if(flag==0)return(0);
    flag=TP_Read_XY(&x2,&y2);	   
    if(flag==0)return(0);   
    if(((x2<=x1&&x1<x2+ERR_RANGE)||(x1<=x2&&x2<x1+ERR_RANGE))//前后两次采样在+-50内
    &&((y2<=y1&&y1<y2+ERR_RANGE)||(y1<=y2&&y2<y1+ERR_RANGE)))
    {
        *x=(x1+x2)/2;
        *y=(y1+y2)/2;
        return 1;
    }else return 0;	  
}  
//////////////////////////////////////////////////////////////////////////////////		  
//与LCD部分有关的函数  
//画一个触摸点
//用来校准用的
//x,y:坐标
//color:颜色
void TP_Drow_Touch_Point(u16 x,u16 y,u16 color)
{
	POINT_COLOR=color;
	LCD_DrawLine(x-12,y,x+13,y);//横线
	LCD_DrawLine(x,y-12,x,y+13);//竖线
	LCD_DrawPoint(x+1,y+1);
	LCD_DrawPoint(x-1,y+1);
	LCD_DrawPoint(x+1,y-1);
	LCD_DrawPoint(x-1,y-1);
	Draw_Circle(x,y,6);//画中心圈
}	  
//画一个大点(2*2的点)		   
//x,y:坐标
//color:颜色
void TP_Draw_Big_Point(u16 x,u16 y,u16 color)
{	    
	POINT_COLOR=color;
	LCD_DrawPoint(x,y);//中心点 
	LCD_DrawPoint(x+1,y);
	LCD_DrawPoint(x,y+1);
	LCD_DrawPoint(x+1,y+1);	 	  	
}						  
//////////////////////////////////////////////////////////////////////////////////		  
//触摸按键扫描
//tp:0,屏幕坐标;1,物理坐标(校准等特殊场合用)
//返回值:当前触屏状态.
//0,触屏无触摸;1,触屏有触摸
u8 TP_Scan(u8 tp)
{			   
	if(PEN==0)//有按键按下
	{
		if(tp)TP_Read_XY2(&TouchX,&TouchY);//读取物理坐标
		else if(TP_Read_XY2(&TouchX,&TouchY))//读取屏幕坐标
		{
			if(TouchX>10 && TouchX<4050 && TouchY>10 && TouchY<4050)
			{
				TouchX=TouchFacX*TouchX+TouchXoff;//将结果转换为屏幕坐标
				TouchY=TouchFacY*TouchY+TouchYoff;  
			}
				
	 	} 
		if((TouchSta&TP_PRES_DOWN)==0)//之前没有被按下
		{		 
			TouchSta=TP_PRES_DOWN|TP_CATH_PRES;//按键按下  
			TouchXBak=TouchX;//记录第一次按下时的坐标
			TouchYBak=TouchY;  	   			 
		}			   
	}else
	{
		if(TouchSta&TP_PRES_DOWN)//之前是被按下的
		{
			TouchSta&=~(1<<7);//标记按键松开	
		}else//之前就没有被按下
		{
			TouchXBak=0;
			TouchYBak=0;
			TouchX=0xffff;
			TouchY=0xffff;
		}	    
	}
	return TouchSta&TP_PRES_DOWN;//返回当前的触屏状态
}	  
//////////////////////////////////////////////////////////////////////////	 
//保存在EEPROM里面的地址区间基址,占用13个字节(RANGE:SAVE_ADDR_BASE~SAVE_ADDR_BASE+12)
#define SAVE_ADDR_BASE 40
//保存校准参数										    
void TP_Save_Adjdata(void)
{  
	s32 temp;			 
	//保存校正结果!		   							  
	temp=TouchFacX*100000000;//保存x校正因素      
    AT24CXX_WriteLenByte(SAVE_ADDR_BASE,temp,4);   
	temp=TouchFacY*100000000;//保存y校正因素    
    AT24CXX_WriteLenByte(SAVE_ADDR_BASE+4,temp,4);
	//保存x偏移量
    AT24CXX_WriteLenByte(SAVE_ADDR_BASE+8,TouchXoff,2);		    
	//保存y偏移量
	AT24CXX_WriteLenByte(SAVE_ADDR_BASE+10,TouchYoff,2);	
	//保存触屏类型
	AT24CXX_WriteOneByte(SAVE_ADDR_BASE+12,TouchType);	
	temp=0X0A;//标记校准过了
	AT24CXX_WriteOneByte(SAVE_ADDR_BASE+13,temp); 
}
//得到保存在EEPROM里面的校准值
//返回值：1，成功获取数据
//        0，获取失败，要重新校准
u8 TP_Get_Adjdata(void)
{		  
	s32 tempfac;			  
	u8 temp;
	temp=AT24CXX_ReadOneByte(SAVE_ADDR_BASE+13);//读取标记字,看是否校准过！ 		 
	if(temp==0X0A)//触摸屏已经校准过了			   
	{    												 
		tempfac=AT24CXX_ReadLenByte(SAVE_ADDR_BASE,4);		   
		TouchFacX=(float)tempfac/100000000;//得到x校准参数
		tempfac=AT24CXX_ReadLenByte(SAVE_ADDR_BASE+4,4);			          
		TouchFacY=(float)tempfac/100000000;//得到y校准参数
	    //得到x偏移量
		TouchXoff=AT24CXX_ReadLenByte(SAVE_ADDR_BASE+8,2);			   	  
 	    //得到y偏移量
		TouchYoff=AT24CXX_ReadLenByte(SAVE_ADDR_BASE+10,2);				 	  
 		TouchType=AT24CXX_ReadOneByte(SAVE_ADDR_BASE+12);//读取触屏类型标记
		if(TouchType)//X,Y方向与屏幕相反
		{
			CMD_RDX=0X90;
			CMD_RDY=0XD0;	 
		}else				   //X,Y方向与屏幕相同
		{
			CMD_RDX=0XD0;
			CMD_RDY=0X90;	 
		}		 
		return 1;	 
	}
	return 0;
}	 
//提示字符串
const char* TP_REMIND_MSG_TBL="Please use the stylus click the cross on the screen.The cross will always move until the screen adjustment is completed.";
 					  
//提示校准结果(各个参数)
void TP_Adj_Info_Show(u16 x0,u16 y0,u16 x1,u16 y1,u16 x2,u16 y2,u16 x3,u16 y3,u16 fac)
{	  
	POINT_COLOR=RED;
	LCD_ShowString(40,160,lcddev.width,lcddev.height,16,(u8*)"x1:");
 	LCD_ShowString(40+80,160,lcddev.width,lcddev.height,16,(u8*)"y1:");
 	LCD_ShowString(40,180,lcddev.width,lcddev.height,16,(u8*)"x2:");
 	LCD_ShowString(40+80,180,lcddev.width,lcddev.height,16,(u8*)"y2:");
	LCD_ShowString(40,200,lcddev.width,lcddev.height,16,(u8*)"x3:");
 	LCD_ShowString(40+80,200,lcddev.width,lcddev.height,16,(u8*)"y3:");
	LCD_ShowString(40,220,lcddev.width,lcddev.height,16,(u8*)"x4:");
 	LCD_ShowString(40+80,220,lcddev.width,lcddev.height,16,(u8*)"y4:");  
 	LCD_ShowString(40,240,lcddev.width,lcddev.height,16,(u8*)"fac is:");     
	LCD_ShowNum(40+24,160,x0,4,16);		//显示数值
	LCD_ShowNum(40+24+80,160,y0,4,16);	//显示数值
	LCD_ShowNum(40+24,180,x1,4,16);		//显示数值
	LCD_ShowNum(40+24+80,180,y1,4,16);	//显示数值
	LCD_ShowNum(40+24,200,x2,4,16);		//显示数值
	LCD_ShowNum(40+24+80,200,y2,4,16);	//显示数值
	LCD_ShowNum(40+24,220,x3,4,16);		//显示数值
	LCD_ShowNum(40+24+80,220,y3,4,16);	//显示数值
 	LCD_ShowNum(40+56,lcddev.width,fac,3,16); 	//显示数值,该数值必须在95~105范围之内.

}
		 
//校准点参数：(0,1)与(2,3)，(0,2)与(1,3),(1,2)与(0,3)，这三组点的距离
const u8 TP_ADJDIS_TBL[3][4]={{0,1,2,3},{0,2,1,3},{1,2,0,3}};//校准距离计算表
//触摸屏校准代码
//得到四个校准参数
void TP_Adjust(void)
{								 
	u16 pos_temp[4][2];//坐标缓存值
	u8  cnt=0;	
	u16 d1,d2;
	u32 tem1,tem2;
	float fac; 	
	u16 outtime=0; 	  
	LCD_Clear(WHITE);	//清屏 	    
	POINT_COLOR=BLUE;	//蓝色
	LCD_ShowString(40,40,160,100,16,(u8*)TP_REMIND_MSG_TBL);//显示提示信息
	TP_Drow_Touch_Point(20,20,RED);//画点1 
	TouchSta=0;//消除触发信号 
	TouchFacX=0;//xfac用来标记是否校准过,所以校准之前必须清掉!以免错误	 
	while(1)//如果连续10秒钟没有按下,则自动退出
	{
READJ:
		TP_Scan(1);//扫描物理坐标
		if((TouchSta&0xc0)==TP_CATH_PRES)//按键按下了一次(此时按键松开了.)
		{	
			outtime=0;		
			TouchSta&=~(1<<6);	//标记按键已经被处理过了. 
			pos_temp[cnt][0]=TouchX;
			pos_temp[cnt][1]=TouchY;
			cnt++;	  
			switch(cnt)
			{			   
				case 1:						 
					TP_Drow_Touch_Point(20,20,WHITE);				//清除点1 
					TP_Drow_Touch_Point(lcddev.width-20,20,RED);	//画点2
					break;
				case 2:
 					TP_Drow_Touch_Point(lcddev.width-20,20,WHITE);	//清除点2
					TP_Drow_Touch_Point(20,lcddev.height-20,RED);	//画点3
					break;
				case 3:
 					TP_Drow_Touch_Point(20,lcddev.height-20,WHITE);			//清除点3
 					TP_Drow_Touch_Point(lcddev.width-20,lcddev.height-20,RED);	//画点4
					break;                                                                                                                                                                                                                                                          
				case 4:	 //全部四个点已经得到
					for(cnt=0;cnt<3;cnt++)//计算三组点的距离是否在允许范围内？
					{ 
						tem1=abs(pos_temp[TP_ADJDIS_TBL[cnt][0]][0]-pos_temp[TP_ADJDIS_TBL[cnt][1]][0]);//x1-x2/x1-x3/x2-x3
						tem2=abs(pos_temp[TP_ADJDIS_TBL[cnt][0]][1]-pos_temp[TP_ADJDIS_TBL[cnt][1]][1]);//y1-y2/y1-y3/y2-y3
						tem1*=tem1;
						tem2*=tem2;
						d1=sqrt(tem1+tem2);//得到两点之间的距离 
						tem1=abs(pos_temp[TP_ADJDIS_TBL[cnt][2]][0]-pos_temp[TP_ADJDIS_TBL[cnt][3]][0]);//x3-x4/x2-x4/x1-x4
						tem2=abs(pos_temp[TP_ADJDIS_TBL[cnt][2]][1]-pos_temp[TP_ADJDIS_TBL[cnt][3]][1]);//y3-y4/y2-y4/y1-y4
						tem1*=tem1;
						tem2*=tem2;
						d2=sqrt(tem1+tem2);//得到两点之间的距离
						fac=(float)d1/d2;
						if(fac<0.95||fac>1.05||d1==0||d2==0)//不合格
						{
							cnt=0;
							TP_Drow_Touch_Point(lcddev.width-20,lcddev.height-20,WHITE);	//清除点4
							TP_Drow_Touch_Point(20,20,RED);									//画点1
							TP_Adj_Info_Show(pos_temp[0][0],pos_temp[0][1],pos_temp[1][0],pos_temp[1][1],pos_temp[2][0],pos_temp[2][1],pos_temp[3][0],pos_temp[3][1],fac*100);//显示数据   
							goto READJ;	//不合格，重新校准
						}
					}  
					//正确了
					//计算结果
					TouchFacX=(float)(lcddev.width-40)/(pos_temp[1][0]-pos_temp[0][0]);//得到xfac		 
					TouchXoff=(lcddev.width-TouchFacX*(pos_temp[1][0]+pos_temp[0][0]))/2;//得到xoff
 					TouchFacY=(float)(lcddev.height-40)/(pos_temp[2][1]-pos_temp[0][1]);//得到yfac
					TouchYoff=(lcddev.height-TouchFacY*(pos_temp[2][1]+pos_temp[0][1]))/2;//得到yoff  
					if(abs(TouchFacX)>2||abs(TouchFacY)>2)//触屏和预设的相反了.
					{
						cnt=0;
 				    	TP_Drow_Touch_Point(lcddev.width-20,lcddev.height-20,WHITE);	//清除点4
   	 					TP_Drow_Touch_Point(20,20,RED);								//画点1
						LCD_ShowString(40,26,lcddev.width,lcddev.height,16,(u8*)"TP Need readjust!");
						TouchType=!TouchType;//修改触屏类型.
						if(TouchType)//X,Y方向与屏幕相反
						{
							CMD_RDX=0X90;
							CMD_RDY=0XD0;	 
						}else				   //X,Y方向与屏幕相同
						{
							CMD_RDX=0XD0;
							CMD_RDY=0X90;	 
						}			    
						continue;
					}		
					POINT_COLOR=BLUE;
					LCD_Clear(WHITE);//清屏
					LCD_ShowString(35,110,lcddev.width,lcddev.height,16,(u8*)"Touch Screen Adjust OK!");//校正完成
					delay_ms(1000);
					TP_Save_Adjdata();  
 					LCD_Clear(WHITE);//清屏   
					return;//校正完成				 
			}
		}
		delay_ms(10);
		outtime++;
		if(outtime>1000)
		{
			TP_Get_Adjdata();
			break;
	 	} 
 	}
}	  
//触摸屏初始化  		    
//返回值:0,没有进行校准
//       1,进行过校准
u8 TP_Init(void)
{		
	
	//使能PC端口的时钟
	CKCU_PeripClockConfig_TypeDef CKCUClock = {{0}};
	CKCUClock.Bit.PA         = 1;
	CKCUClock.Bit.PB        = 1;
	CKCUClock.Bit.AFIO       = 1;
	CKCU_PeripClockConfig(CKCUClock, ENABLE);

	//配置端口功能为GPIO
	AFIO_GPxConfig(GPIO_PA, GPIO_PIN_4|GPIO_PIN_5|GPIO_PIN_6|GPIO_PIN_7, AFIO_FUN_GPIO);
    AFIO_GPxConfig(GPIO_PB, GPIO_PIN_8, AFIO_FUN_GPIO);
	
	GPIO_DirectionConfig(HT_GPIOA, GPIO_PIN_4|GPIO_PIN_5|GPIO_PIN_7, GPIO_DIR_OUT);
	GPIO_DirectionConfig(HT_GPIOA, GPIO_PIN_6, GPIO_DIR_IN);
	GPIO_DirectionConfig(HT_GPIOB, GPIO_PIN_8, GPIO_DIR_IN);

	//使能输入
	GPIO_InputConfig(HT_GPIOA, GPIO_PIN_6,ENABLE);
	GPIO_InputConfig(HT_GPIOB, GPIO_PIN_8,ENABLE);

	//配置上拉电阻
	GPIO_PullResistorConfig(HT_GPIOA, GPIO_PIN_6,GPIO_PR_UP);
	GPIO_PullResistorConfig(HT_GPIOB, GPIO_PIN_8,GPIO_PR_UP);
	
	
	TP_Read_XY(&TouchX,&TouchY);//第一次读取初始化	
	
	AT24CXX_Init();//初始化24CXX
	
	if(TP_Get_Adjdata())
	return 0;//已经校准
	else	 //未校准
	{ 										    
		LCD_Clear(WHITE);//清屏
		TP_Adjust();  //屏幕校准 
		TP_Save_Adjdata();	 
	}			
	TP_Get_Adjdata();	
	
	return 1; 									 
}






